Revit 2026 API
RadialArray.Create Method
Overload List
Name | Description
Create(Document, View, ElementId, Int32, Line, Double, ArrayAnchorMember) |  Creates a new radial array element from a single element based on an input rotation axis.
Create(Document, View, ICollection<ElementId>, Int32, Line, Double, ArrayAnchorMember)
Top
See Also
Reference
RadialArray Class
Autodesk.Revit.DB Namespace